{"pageProps":{"post":{"title":"Att väcka liv i ett 3 år gammalt projekt i 6 enkla steg","date":"2020-03-29T00:00:00.000Z","summary":"För tre år sedan skapade jag ett projekt som skrapade Aftonbladet dagligen. Det här är historien om vad som hände 3 år senare.","body":{"raw":"\n## Bakgrund\n\nÅr 2017 använda jag PHP-ramverket Laravel en del för att bygga sajter, tillsammans med Vue som frontend. En sajt jag byggde gick ut på att varje dag skrapa Aftonbladet på lite onödig information så att sajten kunde visa upp denna information i en schysst graf. Sajten skrapade hur många ✔ Aftonbladet använde varje dag och sparade ner antalet i en postgesdatabas som snurrade på Heroku.\n\nJag byggde sajten, satte upp ett cronjob i Heroku, implementerade en graf som visade antalet ”checkers” de senaste dagarna och gick sedan vidare till andra projekt.\n\nDagarna gick, månaderna gick, åren gick och plötsligt är det år 2020 och den här sajten har samlat in 3 års data. Det fanns ett litet problem dock. Sajten visade bara data för de senaste dagarna i en enda stackars graf. Med 3 års data borde man kunna få till lite mer roliga grafer och skära i datat på lite alla möjliga sätt för att presentera datat.\n\n### Vägen framåt\n\nJag stod inför ett val. Mycket har hänt sedan 2017 och jag sysslar för det mesta med fullstack JavaScript/TypeScript och inte så mycket PHP längre. Antingen dammar jag av mina PHP skills eller så tar jag tillfälle i akt att helt enkelt bygga om hela det här projektet.\n\nJag byggde såklart om hela projektet… Ingen sten lämnades orörd utan frontend och backend byttes ut och även databasen byttes ut.\n\nDet här är alltså en liten historia om hur jag väckte liv i ett tre år gammalt projekt och bytte ut Vue, Laravel och Postgres mot React, Next.js och Google Firestore i 6 ”enkla” steg.\n\n## Steg 1: Hitta lämplig fullstack JavaScript-lösning\n\nDå jag inte ville spendera alldeles för mycket tid med att sätta upp en utvecklingsmiljö utan istället förlita mig på en lösning som är lite mer åt ”Convention over configuration” hade jag en lista med önskemål att uppfylla för en fullstack JavaScript-lösning:\n\n1. **Bra** TypeScript support.\n2. **Reactbaserad** frontend.\n3. **Snabb och enkel** node-implementation då jag bara behöver göra ett fåtal API-anrop.\n4. **Snabbt** att komma igång utan överdrivet mycket tooling.\n\n### 1.1 Rätt verktyg för jobbet\n\nUtifrån denna lista tyckte jag att react-ramverket Next.js checkade av de mesta av mina önskemål då det är reactbaserat, har bra TypeScript stöd, Serverless functions för enkel backend och en rad andra schyssta features.\n\n✓ Steg 1 check!\n\n## Steg 2: Exportera data och se över datamodellen\n\nDet tidigare projektet sparade alltså data i en Postgres-databas som snurrade på Heroku. Det var alltså inte speciellt svårt att exportera den databasen:\n\n1. Logga in i Heroku-projektet med Heroku CLI\n2. Kopiera ned all data till csv-fil.\n\n### 2.1 Exportera data\n\nJag använde följande kommando när jag väl var inloggad i Heroku-projektets postgres från terminalen:\n\n```bash\n$ \\COPY checkers TO '~/aftonbladet-checkers.csv' WITH (FORMAT csv, DELIMITER ',',  HEADER true);\n```\n\nI och med att jag kör med JavaScript på backend-sidan så kändes det mest lämpligt att jobba med json och med tanke på att det nya projektet (steg 3 spoilers) sparar data i Google Firestore.\n\n### 2.2 Se över datamodellen\n\nJag konverterade datan från csv-filen till json och såg över datamodellen något - döpte om något fält men i övrigt kändes det nya json-baserade datat redo för att importeras in i en ny källa.\n\n✓ Steg 2 check!\n\n## Steg 3: Importera data till ny källa\n\nJag ville ha en enkel lösning när det gällde datakälla och helst något baserat på NoSQL. Jag ville i princip bara spara en platt lista med json-objekt som representerade varje skrapad dag med antal checkers. Jag har tidigare använt Googles Firestore lösning för en enklare backend och denna gång använde jag mig av Googles nyare lösning - Firestore.\n\n### 3.1 Importera historisk data\n\nMen nu hade jag alltså data för 3 år som behöver seedas in i Firestore. Det hade man kunnat lösa på en rad olika sätt men jag implementerade seedning av datat med hjälp av ett API-anrop (Next.js serverless function).\n\n### 3.2 API för att slanga in data\n\nEn schysst grej med Next är att om man exporterar en modul i `pages/api/example.ts` så representerar modulen ett api anrop. Det är alltså filstrukturen som bestämmer hur api-anropen sätts upp.Jag skapade ett API-anrop på det här sättet och skyddade anropet bakom API nyckel och nu hade jag ett sätt att mata den nya källan med all historisk data.\n\n✓ Steg 3 check!\n\n## Steg 4: Bygg ny backend\n\nSom tidigare nämnt så bygger ju backend i Next på serverless functions. Min backend i det här fallet byggdes upp av olika API-anrop för att seeda, hämta data och även api-anrop för att skrapa dagens antal checkers. Att ha filstruktur-baserad API-anropsuppsättning (säg det snabbt tre gånger) var väldigt smidigt i ett sånt här projekt som ändå är så pass litet.\n\n### 4.1 Enkel routing\n\nJag behövde aldrig sätta upp egna route-handles p.g.a det utan behövde bara skapa rätt filer på rätt ställe i filstrukturen. I och med att jag inte ville lägga flera helger på detta projekt så passade Next:s upplägg med serverless functions perfekt.\n\n✓ Steg 4 check!\n\n## Steg 5: Bygg ny frontend\n\nHistoriskt sätt har jag ägnat mig mest åt Vue när det kommer till frontend - mycket för att jag tidigare använde en del Laravel som hade Vue som sitt default frontend. Men av olika skäl använder jag mest React nuförtiden, som dessutom är som handen i handsken när det kommer till TypeScript.\n\n### 5.1 Konsumera och massera data\n\nAtt bygga frontend gick rätt fort. Endast ett API-anrop till backend implementerades och en rad utils-funktioner implementerades för att ”massera” datat på olika sätt för att kunna presentera det i olika grafer såsom exempelvis årsvis, kvartalsvis och enligt veckans dagar.\n\n### 5.2 Fördelen med fullstack JavaScript\n\nFördelen med fullstack JavaScript innebär ju att alla utils-funktioner skulle kunna refaktoreras att användas i en serverless function istället - om man nu vill flytta mer logik från frontend till backend. Men med tanke på projektets storlek kändes det som att frontenden lika gärna kunde göra ett anrop och sen massera samma data på olika sätt för att fylla graferna.\n\n✓ Steg 5 check!\n\n## Steg 6: Förbättra infrastrukturen och se över CI/CD\n\nFörbättra och förbättra… Infrastrukturen tyckte jag egentligen inte att jag behövde göra speciellt mycket åt.\n\n### 6.1 Sätt upp Travis CI\n\nHeroku funkar bra och att applikationer byggs om när något händer på master branchen är ju väldigt schysst. Däremot hade det ju varit lite av en trygghet om något CI bygge skedde på varje push och varje merge request - för att försöka förhindra problem innan de uppstår.\nJag kopplade Travis CI till repot och på varje push och merge request körs ett skript som lintar projektet och verifierar att projektet går att bygga.\n\n### 6.2 Cronjob\n\nMen hur blev det med cronjob för att skrapa Aftonbladet dagligen? Ja… tidigare användes ju Laravel som hade väldigt schyssta möjligheter att schemalägga jobb. Next är lite mer barebones. Ett litet fulhack implementerades där ett vanligt bash-script CURL:ar API:et - som i sin tur skrapar dagens antal checkers och sparar ned dom i Firestore. I Heroku kan man schemalägga aktiviteter och helt enkelt så triggas det skriptet dagligen - enkelt men effektivt.\n\n✓ Steg 6 check!\n\n## Slutet gott allting gott\n\nDet var alltså min lilla historia om hur jag i 6 steg väckte liv ett 3 år gammalt projekt. Eller tja.. väckte liv i och väkte liv i...Jag slängde ut allting förutom själva datan - men datan var ju ändå trots allt det viktigaste att spara och behålla i en återuppståndelse likt denna historia.\n\nFör den som är intresserad finns källkoden [här](https://github.com/danielv14/aftonbladet-checkr-next) och sajten går att besöka på [https://aftonbladet-checker.Herokuapp.com/](https://aftonbladet-checker.Herokuapp.com/)\n","code":"var Component=(()=>{var h=Object.create;var i=Object.defineProperty;var g=Object.getOwnPropertyDescriptor;var p=Object.getOwnPropertyNames;var m=Object.getPrototypeOf,k=Object.prototype.hasOwnProperty;var u=(t,e)=>()=>(e||t((e={exports:{}}).exports,e),e.exports),f=(t,e)=>{for(var n in e)i(t,n,{get:e[n],enumerable:!0})},l=(t,e,n,s)=>{if(e&&typeof e==\"object\"||typeof e==\"function\")for(let r of p(e))!k.call(t,r)&&r!==n&&i(t,r,{get:()=>e[r],enumerable:!(s=g(e,r))||s.enumerable});return t};var v=(t,e,n)=>(n=t!=null?h(m(t)):{},l(e||!t||!t.__esModule?i(n,\"default\",{value:t,enumerable:!0}):n,t)),b=t=>l(i({},\"__esModule\",{value:!0}),t);var o=u((S,d)=>{d.exports=_jsx_runtime});var I={};f(I,{default:()=>x,frontmatter:()=>j});var a=v(o()),j={title:\"Att v\\xE4cka liv i ett 3 \\xE5r gammalt projekt i 6 enkla steg\",summary:\"F\\xF6r tre \\xE5r sedan skapade jag ett projekt som skrapade Aftonbladet dagligen. Det h\\xE4r \\xE4r historien om vad som h\\xE4nde 3 \\xE5r senare.\",date:new Date(158544e7)};function c(t){let e=Object.assign({h2:\"h2\",a:\"a\",span:\"span\",p:\"p\",h3:\"h3\",ol:\"ol\",li:\"li\",strong:\"strong\",pre:\"pre\",code:\"code\"},t.components);return(0,a.jsxs)(a.Fragment,{children:[(0,a.jsxs)(e.h2,{id:\"bakgrund\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#bakgrund\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Bakgrund\"]}),`\n`,(0,a.jsx)(e.p,{children:\"\\xC5r 2017 anv\\xE4nda jag PHP-ramverket Laravel en del f\\xF6r att bygga sajter, tillsammans med Vue som frontend. En sajt jag byggde gick ut p\\xE5 att varje dag skrapa Aftonbladet p\\xE5 lite on\\xF6dig information s\\xE5 att sajten kunde visa upp denna information i en schysst graf. Sajten skrapade hur m\\xE5nga \\u2714 Aftonbladet anv\\xE4nde varje dag och sparade ner antalet i en postgesdatabas som snurrade p\\xE5 Heroku.\"}),`\n`,(0,a.jsx)(e.p,{children:\"Jag byggde sajten, satte upp ett cronjob i Heroku, implementerade en graf som visade antalet \\u201Dcheckers\\u201D de senaste dagarna och gick sedan vidare till andra projekt.\"}),`\n`,(0,a.jsx)(e.p,{children:\"Dagarna gick, m\\xE5naderna gick, \\xE5ren gick och pl\\xF6tsligt \\xE4r det \\xE5r 2020 och den h\\xE4r sajten har samlat in 3 \\xE5rs data. Det fanns ett litet problem dock. Sajten visade bara data f\\xF6r de senaste dagarna i en enda stackars graf. Med 3 \\xE5rs data borde man kunna f\\xE5 till lite mer roliga grafer och sk\\xE4ra i datat p\\xE5 lite alla m\\xF6jliga s\\xE4tt f\\xF6r att presentera datat.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"v\\xE4gen-fram\\xE5t\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#v\\xE4gen-fram\\xE5t\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"V\\xE4gen fram\\xE5t\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Jag stod inf\\xF6r ett val. Mycket har h\\xE4nt sedan 2017 och jag sysslar f\\xF6r det mesta med fullstack JavaScript/TypeScript och inte s\\xE5 mycket PHP l\\xE4ngre. Antingen dammar jag av mina PHP skills eller s\\xE5 tar jag tillf\\xE4lle i akt att helt enkelt bygga om hela det h\\xE4r projektet.\"}),`\n`,(0,a.jsx)(e.p,{children:\"Jag byggde s\\xE5klart om hela projektet\\u2026 Ingen sten l\\xE4mnades or\\xF6rd utan frontend och backend byttes ut och \\xE4ven databasen byttes ut.\"}),`\n`,(0,a.jsx)(e.p,{children:\"Det h\\xE4r \\xE4r allts\\xE5 en liten historia om hur jag v\\xE4ckte liv i ett tre \\xE5r gammalt projekt och bytte ut Vue, Laravel och Postgres mot React, Next.js och Google Firestore i 6 \\u201Denkla\\u201D steg.\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-1-hitta-l\\xE4mplig-fullstack-javascript-l\\xF6sning\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-1-hitta-l\\xE4mplig-fullstack-javascript-l\\xF6sning\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 1: Hitta l\\xE4mplig fullstack JavaScript-l\\xF6sning\"]}),`\n`,(0,a.jsx)(e.p,{children:\"D\\xE5 jag inte ville spendera alldeles f\\xF6r mycket tid med att s\\xE4tta upp en utvecklingsmilj\\xF6 utan ist\\xE4llet f\\xF6rlita mig p\\xE5 en l\\xF6sning som \\xE4r lite mer \\xE5t \\u201DConvention over configuration\\u201D hade jag en lista med \\xF6nskem\\xE5l att uppfylla f\\xF6r en fullstack JavaScript-l\\xF6sning:\"}),`\n`,(0,a.jsxs)(e.ol,{children:[`\n`,(0,a.jsxs)(e.li,{children:[(0,a.jsx)(e.strong,{children:\"Bra\"}),\" TypeScript support.\"]}),`\n`,(0,a.jsxs)(e.li,{children:[(0,a.jsx)(e.strong,{children:\"Reactbaserad\"}),\" frontend.\"]}),`\n`,(0,a.jsxs)(e.li,{children:[(0,a.jsx)(e.strong,{children:\"Snabb och enkel\"}),\" node-implementation d\\xE5 jag bara beh\\xF6ver g\\xF6ra ett f\\xE5tal API-anrop.\"]}),`\n`,(0,a.jsxs)(e.li,{children:[(0,a.jsx)(e.strong,{children:\"Snabbt\"}),\" att komma ig\\xE5ng utan \\xF6verdrivet mycket tooling.\"]}),`\n`]}),`\n`,(0,a.jsxs)(e.h3,{id:\"11-r\\xE4tt-verktyg-f\\xF6r-jobbet\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#11-r\\xE4tt-verktyg-f\\xF6r-jobbet\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"1.1 R\\xE4tt verktyg f\\xF6r jobbet\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Utifr\\xE5n denna lista tyckte jag att react-ramverket Next.js checkade av de mesta av mina \\xF6nskem\\xE5l d\\xE5 det \\xE4r reactbaserat, har bra TypeScript st\\xF6d, Serverless functions f\\xF6r enkel backend och en rad andra schyssta features.\"}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 1 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-2-exportera-data-och-se-\\xF6ver-datamodellen\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-2-exportera-data-och-se-\\xF6ver-datamodellen\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 2: Exportera data och se \\xF6ver datamodellen\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Det tidigare projektet sparade allts\\xE5 data i en Postgres-databas som snurrade p\\xE5 Heroku. Det var allts\\xE5 inte speciellt sv\\xE5rt att exportera den databasen:\"}),`\n`,(0,a.jsxs)(e.ol,{children:[`\n`,(0,a.jsx)(e.li,{children:\"Logga in i Heroku-projektet med Heroku CLI\"}),`\n`,(0,a.jsx)(e.li,{children:\"Kopiera ned all data till csv-fil.\"}),`\n`]}),`\n`,(0,a.jsxs)(e.h3,{id:\"21-exportera-data\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#21-exportera-data\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"2.1 Exportera data\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Jag anv\\xE4nde f\\xF6ljande kommando n\\xE4r jag v\\xE4l var inloggad i Heroku-projektets postgres fr\\xE5n terminalen:\"}),`\n`,(0,a.jsx)(e.pre,{className:\"language-bash\",children:(0,a.jsx)(e.code,{className:\"language-bash code-highlight\",children:(0,a.jsxs)(e.span,{className:\"code-line\",children:[\"$ \",(0,a.jsx)(e.span,{className:\"token punctuation\",children:\"\\\\\"}),\"COPY checkers TO \",(0,a.jsx)(e.span,{className:\"token string\",children:\"'~/aftonbladet-checkers.csv'\"}),\" WITH \",(0,a.jsx)(e.span,{className:\"token punctuation\",children:\"(\"}),\"FORMAT csv, DELIMITER \",(0,a.jsx)(e.span,{className:\"token string\",children:\"','\"}),\",  HEADER \",(0,a.jsx)(e.span,{className:\"token boolean\",children:\"true\"}),(0,a.jsx)(e.span,{className:\"token punctuation\",children:\")\"}),(0,a.jsx)(e.span,{className:\"token punctuation\",children:\";\"}),`\n`]})})}),`\n`,(0,a.jsx)(e.p,{children:\"I och med att jag k\\xF6r med JavaScript p\\xE5 backend-sidan s\\xE5 k\\xE4ndes det mest l\\xE4mpligt att jobba med json och med tanke p\\xE5 att det nya projektet (steg 3 spoilers) sparar data i Google Firestore.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"22-se-\\xF6ver-datamodellen\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#22-se-\\xF6ver-datamodellen\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"2.2 Se \\xF6ver datamodellen\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Jag konverterade datan fr\\xE5n csv-filen till json och s\\xE5g \\xF6ver datamodellen n\\xE5got - d\\xF6pte om n\\xE5got f\\xE4lt men i \\xF6vrigt k\\xE4ndes det nya json-baserade datat redo f\\xF6r att importeras in i en ny k\\xE4lla.\"}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 2 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-3-importera-data-till-ny-k\\xE4lla\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-3-importera-data-till-ny-k\\xE4lla\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 3: Importera data till ny k\\xE4lla\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Jag ville ha en enkel l\\xF6sning n\\xE4r det g\\xE4llde datak\\xE4lla och helst n\\xE5got baserat p\\xE5 NoSQL. Jag ville i princip bara spara en platt lista med json-objekt som representerade varje skrapad dag med antal checkers. Jag har tidigare anv\\xE4nt Googles Firestore l\\xF6sning f\\xF6r en enklare backend och denna g\\xE5ng anv\\xE4nde jag mig av Googles nyare l\\xF6sning - Firestore.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"31-importera-historisk-data\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#31-importera-historisk-data\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"3.1 Importera historisk data\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Men nu hade jag allts\\xE5 data f\\xF6r 3 \\xE5r som beh\\xF6ver seedas in i Firestore. Det hade man kunnat l\\xF6sa p\\xE5 en rad olika s\\xE4tt men jag implementerade seedning av datat med hj\\xE4lp av ett API-anrop (Next.js serverless function).\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"32-api-f\\xF6r-att-slanga-in-data\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#32-api-f\\xF6r-att-slanga-in-data\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"3.2 API f\\xF6r att slanga in data\"]}),`\n`,(0,a.jsxs)(e.p,{children:[\"En schysst grej med Next \\xE4r att om man exporterar en modul i \",(0,a.jsx)(e.code,{children:\"pages/api/example.ts\"}),\" s\\xE5 representerar modulen ett api anrop. Det \\xE4r allts\\xE5 filstrukturen som best\\xE4mmer hur api-anropen s\\xE4tts upp.Jag skapade ett API-anrop p\\xE5 det h\\xE4r s\\xE4ttet och skyddade anropet bakom API nyckel och nu hade jag ett s\\xE4tt att mata den nya k\\xE4llan med all historisk data.\"]}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 3 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-4-bygg-ny-backend\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-4-bygg-ny-backend\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 4: Bygg ny backend\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Som tidigare n\\xE4mnt s\\xE5 bygger ju backend i Next p\\xE5 serverless functions. Min backend i det h\\xE4r fallet byggdes upp av olika API-anrop f\\xF6r att seeda, h\\xE4mta data och \\xE4ven api-anrop f\\xF6r att skrapa dagens antal checkers. Att ha filstruktur-baserad API-anropsupps\\xE4ttning (s\\xE4g det snabbt tre g\\xE5nger) var v\\xE4ldigt smidigt i ett s\\xE5nt h\\xE4r projekt som \\xE4nd\\xE5 \\xE4r s\\xE5 pass litet.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"41-enkel-routing\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#41-enkel-routing\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"4.1 Enkel routing\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Jag beh\\xF6vde aldrig s\\xE4tta upp egna route-handles p.g.a det utan beh\\xF6vde bara skapa r\\xE4tt filer p\\xE5 r\\xE4tt st\\xE4lle i filstrukturen. I och med att jag inte ville l\\xE4gga flera helger p\\xE5 detta projekt s\\xE5 passade Next:s uppl\\xE4gg med serverless functions perfekt.\"}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 4 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-5-bygg-ny-frontend\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-5-bygg-ny-frontend\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 5: Bygg ny frontend\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Historiskt s\\xE4tt har jag \\xE4gnat mig mest \\xE5t Vue n\\xE4r det kommer till frontend - mycket f\\xF6r att jag tidigare anv\\xE4nde en del Laravel som hade Vue som sitt default frontend. Men av olika sk\\xE4l anv\\xE4nder jag mest React nuf\\xF6rtiden, som dessutom \\xE4r som handen i handsken n\\xE4r det kommer till TypeScript.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"51-konsumera-och-massera-data\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#51-konsumera-och-massera-data\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"5.1 Konsumera och massera data\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Att bygga frontend gick r\\xE4tt fort. Endast ett API-anrop till backend implementerades och en rad utils-funktioner implementerades f\\xF6r att \\u201Dmassera\\u201D datat p\\xE5 olika s\\xE4tt f\\xF6r att kunna presentera det i olika grafer s\\xE5som exempelvis \\xE5rsvis, kvartalsvis och enligt veckans dagar.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"52-f\\xF6rdelen-med-fullstack-javascript\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#52-f\\xF6rdelen-med-fullstack-javascript\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"5.2 F\\xF6rdelen med fullstack JavaScript\"]}),`\n`,(0,a.jsx)(e.p,{children:\"F\\xF6rdelen med fullstack JavaScript inneb\\xE4r ju att alla utils-funktioner skulle kunna refaktoreras att anv\\xE4ndas i en serverless function ist\\xE4llet - om man nu vill flytta mer logik fr\\xE5n frontend till backend. Men med tanke p\\xE5 projektets storlek k\\xE4ndes det som att frontenden lika g\\xE4rna kunde g\\xF6ra ett anrop och sen massera samma data p\\xE5 olika s\\xE4tt f\\xF6r att fylla graferna.\"}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 5 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"steg-6-f\\xF6rb\\xE4ttra-infrastrukturen-och-se-\\xF6ver-cicd\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#steg-6-f\\xF6rb\\xE4ttra-infrastrukturen-och-se-\\xF6ver-cicd\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Steg 6: F\\xF6rb\\xE4ttra infrastrukturen och se \\xF6ver CI/CD\"]}),`\n`,(0,a.jsx)(e.p,{children:\"F\\xF6rb\\xE4ttra och f\\xF6rb\\xE4ttra\\u2026 Infrastrukturen tyckte jag egentligen inte att jag beh\\xF6vde g\\xF6ra speciellt mycket \\xE5t.\"}),`\n`,(0,a.jsxs)(e.h3,{id:\"61-s\\xE4tt-upp-travis-ci\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#61-s\\xE4tt-upp-travis-ci\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"6.1 S\\xE4tt upp Travis CI\"]}),`\n`,(0,a.jsx)(e.p,{children:`Heroku funkar bra och att applikationer byggs om n\\xE4r n\\xE5got h\\xE4nder p\\xE5 master branchen \\xE4r ju v\\xE4ldigt schysst. D\\xE4remot hade det ju varit lite av en trygghet om n\\xE5got CI bygge skedde p\\xE5 varje push och varje merge request - f\\xF6r att f\\xF6rs\\xF6ka f\\xF6rhindra problem innan de uppst\\xE5r.\nJag kopplade Travis CI till repot och p\\xE5 varje push och merge request k\\xF6rs ett skript som lintar projektet och verifierar att projektet g\\xE5r att bygga.`}),`\n`,(0,a.jsxs)(e.h3,{id:\"62-cronjob\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#62-cronjob\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"6.2 Cronjob\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Men hur blev det med cronjob f\\xF6r att skrapa Aftonbladet dagligen? Ja\\u2026 tidigare anv\\xE4ndes ju Laravel som hade v\\xE4ldigt schyssta m\\xF6jligheter att schemal\\xE4gga jobb. Next \\xE4r lite mer barebones. Ett litet fulhack implementerades d\\xE4r ett vanligt bash-script CURL:ar API:et - som i sin tur skrapar dagens antal checkers och sparar ned dom i Firestore. I Heroku kan man schemal\\xE4gga aktiviteter och helt enkelt s\\xE5 triggas det skriptet dagligen - enkelt men effektivt.\"}),`\n`,(0,a.jsx)(e.p,{children:\"\\u2713 Steg 6 check!\"}),`\n`,(0,a.jsxs)(e.h2,{id:\"slutet-gott-allting-gott\",children:[(0,a.jsx)(e.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#slutet-gott-allting-gott\",children:(0,a.jsx)(e.span,{className:\"icon icon-link\"})}),\"Slutet gott allting gott\"]}),`\n`,(0,a.jsx)(e.p,{children:\"Det var allts\\xE5 min lilla historia om hur jag i 6 steg v\\xE4ckte liv ett 3 \\xE5r gammalt projekt. Eller tja.. v\\xE4ckte liv i och v\\xE4kte liv i...Jag sl\\xE4ngde ut allting f\\xF6rutom sj\\xE4lva datan - men datan var ju \\xE4nd\\xE5 trots allt det viktigaste att spara och beh\\xE5lla i en \\xE5teruppst\\xE5ndelse likt denna historia.\"}),`\n`,(0,a.jsxs)(e.p,{children:[\"F\\xF6r den som \\xE4r intresserad finns k\\xE4llkoden \",(0,a.jsx)(e.a,{href:\"https://github.com/danielv14/aftonbladet-checkr-next\",children:\"h\\xE4r\"}),\" och sajten g\\xE5r att bes\\xF6ka p\\xE5 \",(0,a.jsx)(e.a,{href:\"https://aftonbladet-checker.Herokuapp.com/\",children:\"https://aftonbladet-checker.Herokuapp.com/\"})]})]})}function y(t={}){let{wrapper:e}=t.components||{};return e?(0,a.jsx)(e,Object.assign({},t,{children:(0,a.jsx)(c,t)})):c(t)}var x=y;return b(I);})();\n;return Component;"},"_id":"posts/att-vacka-liv-i-ett-3-ar-gammalt-projekt.mdx","_raw":{"sourceFilePath":"posts/att-vacka-liv-i-ett-3-ar-gammalt-projekt.mdx","sourceFileName":"att-vacka-liv-i-ett-3-ar-gammalt-projekt.mdx","sourceFileDir":"posts","contentType":"mdx","flattenedPath":"posts/att-vacka-liv-i-ett-3-ar-gammalt-projekt"},"type":"Post","url":"/blogg/att-vacka-liv-i-ett-3-ar-gammalt-projekt","dateFormatted":"2020-03-29"},"prevPost":{"title":"ColorPix och \"Less is more\" UX-förändringar","date":"2019-07-31T00:00:00.000Z","summary":"Med några enklare refaktoreringar blev användarupplevelsen enklare men låter samtidigt användaren göra mer.","body":{"raw":"\n## Bakgrund\n\nFör ett tag sedan lanserade jag de första releaserna ([1.0.0](https://github.com/danielv14/ColorPix/releases/tag/v1.0.0) och [1.0.1](https://github.com/danielv14/ColorPix/releases/tag/v.1.0.1)) för ColorPix - en webbapp som hjälper användare att upptäcka förgpaletter via bilder från Unsplash. Applikationen genererar färgpaletter utifrån bildernas dominanta färger och låter även användare finjustera färgmättnad och ljusstyrka.\nJusteringen av färpaletterna görs med olika reglage och jag tänkte gå igenom lite förändringar UX-mässigt som gjorts i och med release 1.1.0 - där en ”_less is more_” approach har förenklat samt förbättrat färgmanipuleringen i ColorPix.\n\n## Hantering i version 1.0.1\n\nI stora drag gick färgmanipulering till på följande sätt i version 1.0.1:\n\n**Användaren...**\n\n1. **Expanderar** ett bildkort för att komma åt färgmanipuleringsvertyget.\n2. **Väljer** om färgmättnad eller ljusstyrka är det som ska manipuleras i de olika flikarna.\n3. **Justerar** reglage för vald färgmanipulering.\n4. **Klickar** på en knapp för att kopiera en färgpalett till urklippet när denne är nöjd med manipuleringen.\n\n![Gränssnitt-version-1-0-1](/img/posts/colorpix-ux-before.png)\n\n_Bilden visar manipuleringsvertyget i version 1.0.1_\n\n### Begränsningar\n\nVad finns det för begränsningar med gränssnittet i bilden ovan? På rak arm utifrån punktlistan ovan för hur använaren nyttjar verktygen samt skärmbilden för version 1.0.1 kunde jag identifiera följande begränsningar:\n\n#### Plottrigt\n\nGränssnittet känns plottrigt då varje manipuleringsmetod (ökad eller minskad färgmättnad osv) är uppdelat i olika reglage, kopieringsknappar och färgrepresentation.\n\n#### Dold kopieringsknapp\n\nKnappen för att kopiera en färgpalett är dold bakom en knapp som expanderar färgkorten. Användaren har inte heller något intuitivt sätt att kopiera en färgpalett som inte blivit manipulerad. För att kopiera ursprungsfärgerna måste man låta ett reglage vara på 0 och sedan kopiera färgerna i anslutning med knappen för det reglaget.\n\n#### Ökning och minskning i samma led\n\nI och med att varje färgmanipulering är uppdelad i separata reglage går både _ökning_ och _minskning_ av ljusstyrka och färgmättnad från vänster till höger i reglagen. Detta kan uppfattas som förvirrande då man kanske hellre vill likna justeringen av färgmättnad med en icke-digital termometer som går från minusgraden till plusgrader.\n\n#### Endast en manipulering åt gången\n\nEn återkommande orsak till begränsningar är den ”UX-skuld” som uppstod i designvalet att just separera reglagen med egna färgrepresentationer. Uppdelningen innebär att användaren inte kan justera färgmättnad _samtidigt_ som ljusstyrka för en och samma färgrepresentation. Det är denna punkt som i mitt tycke var den största begränsningen med gränssnittet.\n\n### Möjligheter\n\nVad finns det för möjligheter med gränssnittet? I och med att jag själv ändrade gränssnittet för just färgmanipuleringen är det kanske ingen slump att jag identifierade fler begränsningar än möjligheter med gränssnittet. Dock identifierade jag ändå följande möjligheter:\n\n#### Utforska oberoende justeringar utifrån samma bild\n\nUtifrån gränssnittets design kan användaren justera med fler manipuleringar samtidigt utan att ett reglage påverkar ett annat. Detta kan ses som en fördel, beroende på hur man vill utforska och skapa sina färgpaletter.\n\n#### Potentiellt mindre plotter vid ökning av verktyg\n\nDå manipuleringarna är grupperade under flikar minskar en eventuell risk för ett mer plottrigt gränssnitt om verktyget skulle utökas med fler sorters färgmanipuleringar och ännu mer reglage. Dock går det att argumentera för att en ökning av flikar är minst lika plottrigt och användaren får svårt att veta vilket flik som man är ute efter för stunden. Användare kanske dessutom inte skulle vara överens med grupperingen utan vill gruppera flikar och reglage utifrån andra preferenser.\n\n## Förbättrad UX i version 1.1.0\n\nFyra begränsningar och två möjligheter identifierade jag efter att ha använt ColorPix själv sporadiskt i ungefär en månads tid. Sammanfattningsvis kände jag mig begränsad av hur manipuleringsvektyget var utformat och jag kände att jag behövde ta tag i de identifierade begränsningarna för att skapa en bättre användarupplevlese.\n\n![Gränssnitt-version-1-1-0](/img/posts/colorpix-ux-after.png)\n\n_Bilden visar manipuleringsvertyget i version 1.1.0_\n\n### Åtgärdade begränsningar\n\nI och med att jag hade begränsningarna från version 1.0.1 i åtanke när jag utformade det nya gränssnittet kanske det är enklast att utgå från just den listan och lyfta fram hur de punkterna har behandlats:\n\n#### Mindre plottrigt\n\nReglage döljs inte längre bakom flikar och varje reglage har inte längre separata färgrepresentationer.\n\n#### Synlig kopieringsknapp\n\nKopieringsknappen är flyttad och är inte längre dold bakom expandering av ett bildkort. Eftersom att knappen är flyttad blir det tydligare hur användaren kan kopiera ursprungsfärgerna.\n\n#### Ökning och minskning av värden åt olika håll\n\nI och med att reglagen för ökning och minskning inte längre är separerade går inte ökning och minskning ut samma håll - från höger till vänster. Nu följer istället reglagen bättre metaforen för en termometer. Minusvärde på reglaget innebär en minskning av exempelvis färgmättnad och ett plusvärde innebär ökning av färgmättnad.\n\n#### Multipla manipuleringar samtidigt\n\nI och med att reglagen och färgrepresentationerna inte längre är lika hårt knutna i kodbasen går det att låta flera reglage påverka en och samma färgåtergivning. Detta innebär att användaren kan justera exempelvis ökning av färmättnad samtidigt som en minskning av ljusstyrka.\n\nEn följdeffekt av att två reglage nu används för att hantera ökning och minskning av exempelvis färgmättnad är att användare inte behöver separera de två handlingarna rent kognitivt. Man arbetar med \"färgmättnad\" i sin helhet - inte ökning och minskning av färgmättnad separat.\n\nGemensamt för mycket av de åtgärder som gjorts åt begränsningarna i föregående version handlar om att ta tag i den ”UX-skuld” som följde med designvalet att separera reglagen från varandra (ökning/minskning) samt att ett reglage var hårt knutet till en färgåtergivning i kodbasen - det gick inte att använda reglage-komponenten utan att få med en färgrepresentation för reglaget på köpet.\n\n### What's the catch med det nya gränssnittet då?\n\nVad finns det då för nya begränsningar med det nya gränssnittet? Tittar man på framförallt en av möjligheterna med gränssnittet i version 1.0.1 - möjligheten till oberoende manipuleringar utifrån samma bild så märker man att denna möjlighet har blivit en potentiell begränsning istället. Dock ser jag en bättre ratio med möjligheter/begränsningar med det nya gränssnittet om man jämför med föregående version. Jag väljer ändå att se version 1.1.0 som ett steg i rätt riktning rent UX-mässigt.\n\n## Summering av 1.0.1 till 1.1.0\n\nI ett tidigt stadie av ColorPix gjordes några designval som har lett till en del upplevda UX-problem och begränsningar kring verktyget för färgmanipluering. Efter en del användning av befintlig funktionalitet kunde begränsningar identifieras. Problemen handlade i stora drag kring begränsningar i vad användaren kunde göra - på grund av designbeslut i kodbasen. Verktyget upplevdes även otydligt och hade viss dold funktionalitet.\n\nEn ”less is more” approach anammades och en del refraktorering av koden för att ta bort för hårt knutna beroenden mellan komponenter. När komponenterna inte längre var lika hårt knutna med varandra kunde en bättre upplevelse skapas där användare kan på ett enklare sätt än tidigare göra mer avancerade färgmanipuleringar.\n","code":"var Component=(()=>{var m=Object.create;var t=Object.defineProperty;var h=Object.getOwnPropertyDescriptor;var p=Object.getOwnPropertyNames;var c=Object.getPrototypeOf,k=Object.prototype.hasOwnProperty;var f=(r,n)=>()=>(n||r((n={exports:{}}).exports,n),n.exports),u=(r,n)=>{for(var a in n)t(r,a,{get:n[a],enumerable:!0})},l=(r,n,a,d)=>{if(n&&typeof n==\"object\"||typeof n==\"function\")for(let i of p(n))!k.call(r,i)&&i!==a&&t(r,i,{get:()=>n[i],enumerable:!(d=h(n,i))||d.enumerable});return r};var v=(r,n,a)=>(a=r!=null?m(c(r)):{},l(n||!r||!r.__esModule?t(a,\"default\",{value:r,enumerable:!0}):a,r)),b=r=>l(t({},\"__esModule\",{value:!0}),r);var g=f((D,s)=>{s.exports=_jsx_runtime});var I={};u(I,{default:()=>y,frontmatter:()=>j});var e=v(g()),j={title:'ColorPix och \"Less is more\" UX-f\\xF6r\\xE4ndringar',summary:\"Med n\\xE5gra enklare refaktoreringar blev anv\\xE4ndarupplevelsen enklare men l\\xE5ter samtidigt anv\\xE4ndaren g\\xF6ra mer.\",date:new Date(15645312e5)};function o(r){let n=Object.assign({h2:\"h2\",a:\"a\",span:\"span\",p:\"p\",em:\"em\",strong:\"strong\",ol:\"ol\",li:\"li\",img:\"img\",h3:\"h3\",h4:\"h4\"},r.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsxs)(n.h2,{id:\"bakgrund\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#bakgrund\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Bakgrund\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"F\\xF6r ett tag sedan lanserade jag de f\\xF6rsta releaserna (\",(0,e.jsx)(n.a,{href:\"https://github.com/danielv14/ColorPix/releases/tag/v1.0.0\",children:\"1.0.0\"}),\" och \",(0,e.jsx)(n.a,{href:\"https://github.com/danielv14/ColorPix/releases/tag/v.1.0.1\",children:\"1.0.1\"}),`) f\\xF6r ColorPix - en webbapp som hj\\xE4lper anv\\xE4ndare att uppt\\xE4cka f\\xF6rgpaletter via bilder fr\\xE5n Unsplash. Applikationen genererar f\\xE4rgpaletter utifr\\xE5n bildernas dominanta f\\xE4rger och l\\xE5ter \\xE4ven anv\\xE4ndare finjustera f\\xE4rgm\\xE4ttnad och ljusstyrka.\nJusteringen av f\\xE4rpaletterna g\\xF6rs med olika reglage och jag t\\xE4nkte g\\xE5 igenom lite f\\xF6r\\xE4ndringar UX-m\\xE4ssigt som gjorts i och med release 1.1.0 - d\\xE4r en \\u201D`,(0,e.jsx)(n.em,{children:\"less is more\"}),\"\\u201D approach har f\\xF6renklat samt f\\xF6rb\\xE4ttrat f\\xE4rgmanipuleringen i ColorPix.\"]}),`\n`,(0,e.jsxs)(n.h2,{id:\"hantering-i-version-101\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#hantering-i-version-101\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Hantering i version 1.0.1\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I stora drag gick f\\xE4rgmanipulering till p\\xE5 f\\xF6ljande s\\xE4tt i version 1.0.1:\"}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.strong,{children:\"Anv\\xE4ndaren...\"})}),`\n`,(0,e.jsxs)(n.ol,{children:[`\n`,(0,e.jsxs)(n.li,{children:[(0,e.jsx)(n.strong,{children:\"Expanderar\"}),\" ett bildkort f\\xF6r att komma \\xE5t f\\xE4rgmanipuleringsvertyget.\"]}),`\n`,(0,e.jsxs)(n.li,{children:[(0,e.jsx)(n.strong,{children:\"V\\xE4ljer\"}),\" om f\\xE4rgm\\xE4ttnad eller ljusstyrka \\xE4r det som ska manipuleras i de olika flikarna.\"]}),`\n`,(0,e.jsxs)(n.li,{children:[(0,e.jsx)(n.strong,{children:\"Justerar\"}),\" reglage f\\xF6r vald f\\xE4rgmanipulering.\"]}),`\n`,(0,e.jsxs)(n.li,{children:[(0,e.jsx)(n.strong,{children:\"Klickar\"}),\" p\\xE5 en knapp f\\xF6r att kopiera en f\\xE4rgpalett till urklippet n\\xE4r denne \\xE4r n\\xF6jd med manipuleringen.\"]}),`\n`]}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.img,{src:\"/img/posts/colorpix-ux-before.png\",alt:\"Gr\\xE4nssnitt-version-1-0-1\"})}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.em,{children:\"Bilden visar manipuleringsvertyget i version 1.0.1\"})}),`\n`,(0,e.jsxs)(n.h3,{id:\"begr\\xE4nsningar\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#begr\\xE4nsningar\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Begr\\xE4nsningar\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Vad finns det f\\xF6r begr\\xE4nsningar med gr\\xE4nssnittet i bilden ovan? P\\xE5 rak arm utifr\\xE5n punktlistan ovan f\\xF6r hur anv\\xE4naren nyttjar verktygen samt sk\\xE4rmbilden f\\xF6r version 1.0.1 kunde jag identifiera f\\xF6ljande begr\\xE4nsningar:\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"plottrigt\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#plottrigt\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Plottrigt\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Gr\\xE4nssnittet k\\xE4nns plottrigt d\\xE5 varje manipuleringsmetod (\\xF6kad eller minskad f\\xE4rgm\\xE4ttnad osv) \\xE4r uppdelat i olika reglage, kopieringsknappar och f\\xE4rgrepresentation.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"dold-kopieringsknapp\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#dold-kopieringsknapp\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Dold kopieringsknapp\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Knappen f\\xF6r att kopiera en f\\xE4rgpalett \\xE4r dold bakom en knapp som expanderar f\\xE4rgkorten. Anv\\xE4ndaren har inte heller n\\xE5got intuitivt s\\xE4tt att kopiera en f\\xE4rgpalett som inte blivit manipulerad. F\\xF6r att kopiera ursprungsf\\xE4rgerna m\\xE5ste man l\\xE5ta ett reglage vara p\\xE5 0 och sedan kopiera f\\xE4rgerna i anslutning med knappen f\\xF6r det reglaget.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"\\xF6kning-och-minskning-i-samma-led\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#\\xF6kning-och-minskning-i-samma-led\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"\\xD6kning och minskning i samma led\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"I och med att varje f\\xE4rgmanipulering \\xE4r uppdelad i separata reglage g\\xE5r b\\xE5de \",(0,e.jsx)(n.em,{children:\"\\xF6kning\"}),\" och \",(0,e.jsx)(n.em,{children:\"minskning\"}),\" av ljusstyrka och f\\xE4rgm\\xE4ttnad fr\\xE5n v\\xE4nster till h\\xF6ger i reglagen. Detta kan uppfattas som f\\xF6rvirrande d\\xE5 man kanske hellre vill likna justeringen av f\\xE4rgm\\xE4ttnad med en icke-digital termometer som g\\xE5r fr\\xE5n minusgraden till plusgrader.\"]}),`\n`,(0,e.jsxs)(n.h4,{id:\"endast-en-manipulering-\\xE5t-g\\xE5ngen\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#endast-en-manipulering-\\xE5t-g\\xE5ngen\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Endast en manipulering \\xE5t g\\xE5ngen\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"En \\xE5terkommande orsak till begr\\xE4nsningar \\xE4r den \\u201DUX-skuld\\u201D som uppstod i designvalet att just separera reglagen med egna f\\xE4rgrepresentationer. Uppdelningen inneb\\xE4r att anv\\xE4ndaren inte kan justera f\\xE4rgm\\xE4ttnad \",(0,e.jsx)(n.em,{children:\"samtidigt\"}),\" som ljusstyrka f\\xF6r en och samma f\\xE4rgrepresentation. Det \\xE4r denna punkt som i mitt tycke var den st\\xF6rsta begr\\xE4nsningen med gr\\xE4nssnittet.\"]}),`\n`,(0,e.jsxs)(n.h3,{id:\"m\\xF6jligheter\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#m\\xF6jligheter\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"M\\xF6jligheter\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Vad finns det f\\xF6r m\\xF6jligheter med gr\\xE4nssnittet? I och med att jag sj\\xE4lv \\xE4ndrade gr\\xE4nssnittet f\\xF6r just f\\xE4rgmanipuleringen \\xE4r det kanske ingen slump att jag identifierade fler begr\\xE4nsningar \\xE4n m\\xF6jligheter med gr\\xE4nssnittet. Dock identifierade jag \\xE4nd\\xE5 f\\xF6ljande m\\xF6jligheter:\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"utforska-oberoende-justeringar-utifr\\xE5n-samma-bild\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#utforska-oberoende-justeringar-utifr\\xE5n-samma-bild\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Utforska oberoende justeringar utifr\\xE5n samma bild\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Utifr\\xE5n gr\\xE4nssnittets design kan anv\\xE4ndaren justera med fler manipuleringar samtidigt utan att ett reglage p\\xE5verkar ett annat. Detta kan ses som en f\\xF6rdel, beroende p\\xE5 hur man vill utforska och skapa sina f\\xE4rgpaletter.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"potentiellt-mindre-plotter-vid-\\xF6kning-av-verktyg\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#potentiellt-mindre-plotter-vid-\\xF6kning-av-verktyg\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Potentiellt mindre plotter vid \\xF6kning av verktyg\"]}),`\n`,(0,e.jsx)(n.p,{children:\"D\\xE5 manipuleringarna \\xE4r grupperade under flikar minskar en eventuell risk f\\xF6r ett mer plottrigt gr\\xE4nssnitt om verktyget skulle ut\\xF6kas med fler sorters f\\xE4rgmanipuleringar och \\xE4nnu mer reglage. Dock g\\xE5r det att argumentera f\\xF6r att en \\xF6kning av flikar \\xE4r minst lika plottrigt och anv\\xE4ndaren f\\xE5r sv\\xE5rt att veta vilket flik som man \\xE4r ute efter f\\xF6r stunden. Anv\\xE4ndare kanske dessutom inte skulle vara \\xF6verens med grupperingen utan vill gruppera flikar och reglage utifr\\xE5n andra preferenser.\"}),`\n`,(0,e.jsxs)(n.h2,{id:\"f\\xF6rb\\xE4ttrad-ux-i-version-110\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#f\\xF6rb\\xE4ttrad-ux-i-version-110\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"F\\xF6rb\\xE4ttrad UX i version 1.1.0\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Fyra begr\\xE4nsningar och tv\\xE5 m\\xF6jligheter identifierade jag efter att ha anv\\xE4nt ColorPix sj\\xE4lv sporadiskt i ungef\\xE4r en m\\xE5nads tid. Sammanfattningsvis k\\xE4nde jag mig begr\\xE4nsad av hur manipuleringsvektyget var utformat och jag k\\xE4nde att jag beh\\xF6vde ta tag i de identifierade begr\\xE4nsningarna f\\xF6r att skapa en b\\xE4ttre anv\\xE4ndarupplevlese.\"}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.img,{src:\"/img/posts/colorpix-ux-after.png\",alt:\"Gr\\xE4nssnitt-version-1-1-0\"})}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.em,{children:\"Bilden visar manipuleringsvertyget i version 1.1.0\"})}),`\n`,(0,e.jsxs)(n.h3,{id:\"\\xE5tg\\xE4rdade-begr\\xE4nsningar\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#\\xE5tg\\xE4rdade-begr\\xE4nsningar\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"\\xC5tg\\xE4rdade begr\\xE4nsningar\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I och med att jag hade begr\\xE4nsningarna fr\\xE5n version 1.0.1 i \\xE5tanke n\\xE4r jag utformade det nya gr\\xE4nssnittet kanske det \\xE4r enklast att utg\\xE5 fr\\xE5n just den listan och lyfta fram hur de punkterna har behandlats:\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"mindre-plottrigt\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#mindre-plottrigt\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Mindre plottrigt\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Reglage d\\xF6ljs inte l\\xE4ngre bakom flikar och varje reglage har inte l\\xE4ngre separata f\\xE4rgrepresentationer.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"synlig-kopieringsknapp\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#synlig-kopieringsknapp\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Synlig kopieringsknapp\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Kopieringsknappen \\xE4r flyttad och \\xE4r inte l\\xE4ngre dold bakom expandering av ett bildkort. Eftersom att knappen \\xE4r flyttad blir det tydligare hur anv\\xE4ndaren kan kopiera ursprungsf\\xE4rgerna.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"\\xF6kning-och-minskning-av-v\\xE4rden-\\xE5t-olika-h\\xE5ll\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#\\xF6kning-och-minskning-av-v\\xE4rden-\\xE5t-olika-h\\xE5ll\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"\\xD6kning och minskning av v\\xE4rden \\xE5t olika h\\xE5ll\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I och med att reglagen f\\xF6r \\xF6kning och minskning inte l\\xE4ngre \\xE4r separerade g\\xE5r inte \\xF6kning och minskning ut samma h\\xE5ll - fr\\xE5n h\\xF6ger till v\\xE4nster. Nu f\\xF6ljer ist\\xE4llet reglagen b\\xE4ttre metaforen f\\xF6r en termometer. Minusv\\xE4rde p\\xE5 reglaget inneb\\xE4r en minskning av exempelvis f\\xE4rgm\\xE4ttnad och ett plusv\\xE4rde inneb\\xE4r \\xF6kning av f\\xE4rgm\\xE4ttnad.\"}),`\n`,(0,e.jsxs)(n.h4,{id:\"multipla-manipuleringar-samtidigt\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#multipla-manipuleringar-samtidigt\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Multipla manipuleringar samtidigt\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I och med att reglagen och f\\xE4rgrepresentationerna inte l\\xE4ngre \\xE4r lika h\\xE5rt knutna i kodbasen g\\xE5r det att l\\xE5ta flera reglage p\\xE5verka en och samma f\\xE4rg\\xE5tergivning. Detta inneb\\xE4r att anv\\xE4ndaren kan justera exempelvis \\xF6kning av f\\xE4rm\\xE4ttnad samtidigt som en minskning av ljusstyrka.\"}),`\n`,(0,e.jsx)(n.p,{children:'En f\\xF6ljdeffekt av att tv\\xE5 reglage nu anv\\xE4nds f\\xF6r att hantera \\xF6kning och minskning av exempelvis f\\xE4rgm\\xE4ttnad \\xE4r att anv\\xE4ndare inte beh\\xF6ver separera de tv\\xE5 handlingarna rent kognitivt. Man arbetar med \"f\\xE4rgm\\xE4ttnad\" i sin helhet - inte \\xF6kning och minskning av f\\xE4rgm\\xE4ttnad separat.'}),`\n`,(0,e.jsx)(n.p,{children:\"Gemensamt f\\xF6r mycket av de \\xE5tg\\xE4rder som gjorts \\xE5t begr\\xE4nsningarna i f\\xF6reg\\xE5ende version handlar om att ta tag i den \\u201DUX-skuld\\u201D som f\\xF6ljde med designvalet att separera reglagen fr\\xE5n varandra (\\xF6kning/minskning) samt att ett reglage var h\\xE5rt knutet till en f\\xE4rg\\xE5tergivning i kodbasen - det gick inte att anv\\xE4nda reglage-komponenten utan att f\\xE5 med en f\\xE4rgrepresentation f\\xF6r reglaget p\\xE5 k\\xF6pet.\"}),`\n`,(0,e.jsxs)(n.h3,{id:\"whats-the-catch-med-det-nya-gr\\xE4nssnittet-d\\xE5\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#whats-the-catch-med-det-nya-gr\\xE4nssnittet-d\\xE5\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"What's the catch med det nya gr\\xE4nssnittet d\\xE5?\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Vad finns det d\\xE5 f\\xF6r nya begr\\xE4nsningar med det nya gr\\xE4nssnittet? Tittar man p\\xE5 framf\\xF6rallt en av m\\xF6jligheterna med gr\\xE4nssnittet i version 1.0.1 - m\\xF6jligheten till oberoende manipuleringar utifr\\xE5n samma bild s\\xE5 m\\xE4rker man att denna m\\xF6jlighet har blivit en potentiell begr\\xE4nsning ist\\xE4llet. Dock ser jag en b\\xE4ttre ratio med m\\xF6jligheter/begr\\xE4nsningar med det nya gr\\xE4nssnittet om man j\\xE4mf\\xF6r med f\\xF6reg\\xE5ende version. Jag v\\xE4ljer \\xE4nd\\xE5 att se version 1.1.0 som ett steg i r\\xE4tt riktning rent UX-m\\xE4ssigt.\"}),`\n`,(0,e.jsxs)(n.h2,{id:\"summering-av-101-till-110\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#summering-av-101-till-110\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Summering av 1.0.1 till 1.1.0\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I ett tidigt stadie av ColorPix gjordes n\\xE5gra designval som har lett till en del upplevda UX-problem och begr\\xE4nsningar kring verktyget f\\xF6r f\\xE4rgmanipluering. Efter en del anv\\xE4ndning av befintlig funktionalitet kunde begr\\xE4nsningar identifieras. Problemen handlade i stora drag kring begr\\xE4nsningar i vad anv\\xE4ndaren kunde g\\xF6ra - p\\xE5 grund av designbeslut i kodbasen. Verktyget upplevdes \\xE4ven otydligt och hade viss dold funktionalitet.\"}),`\n`,(0,e.jsx)(n.p,{children:\"En \\u201Dless is more\\u201D approach anammades och en del refraktorering av koden f\\xF6r att ta bort f\\xF6r h\\xE5rt knutna beroenden mellan komponenter. N\\xE4r komponenterna inte l\\xE4ngre var lika h\\xE5rt knutna med varandra kunde en b\\xE4ttre upplevelse skapas d\\xE4r anv\\xE4ndare kan p\\xE5 ett enklare s\\xE4tt \\xE4n tidigare g\\xF6ra mer avancerade f\\xE4rgmanipuleringar.\"})]})}function x(r={}){let{wrapper:n}=r.components||{};return n?(0,e.jsx)(n,Object.assign({},r,{children:(0,e.jsx)(o,r)})):o(r)}var y=x;return b(I);})();\n;return Component;"},"_id":"posts/colorpix-ux-forandringar.mdx","_raw":{"sourceFilePath":"posts/colorpix-ux-forandringar.mdx","sourceFileName":"colorpix-ux-forandringar.mdx","sourceFileDir":"posts","contentType":"mdx","flattenedPath":"posts/colorpix-ux-forandringar"},"type":"Post","url":"/blogg/colorpix-ux-forandringar","dateFormatted":"2019-07-31"},"nextPost":{"title":"Att gå från Jekyll till Next.js på tre dagar","date":"2020-06-29T00:00:00.000Z","summary":"Jag har länge funderat på att byta ut Jekyll för här webbplatsen. Efter en del research och funderingar var det görbart på tre dagar.","body":{"raw":"\nFör ett antal år sedan byggde jag min personliga webbplats/portfolio med hjälp av Jekyll. Med hjälp av Jekyll kunde jag skapa en enklare statiskt generad webbplats - där jag kunde skriva enklare artiklar i markdown.\n\nÅren gick och jag uppdaterade sporadiskt denna webbplats med lite design-tweaks och nya artiklar. Nu, år 2020 ser landskapet annorlunda ut när det gäller verktyg för att generera statiska webbplatser och jag kände att det var dags för en förändring.\n\n**Men varför byta ut något som \"funkar? Vad var det för fel på min setup med Jekyll?**\n\nTja...det fanns väl en del anledningar till att jag ansåg att det var dags för en förändring och jag tänkte ta upp några av dom:\n\n- Svårjobbad styling\n- Inget komponenttänk\n- Gammal utvecklingsmiljö\n\n### Svårjobbad styling\n\nNär jag byggde sajten var jag väldigt inne på _lekfull design_. Själva startsidan var uppdelad i olika sektioner som alla i stort sätt hade olika bakgrundsfärger och textfärger. Avsaknaden av konsekvens i design gjorde sajten svårjobbad, rent designmässigt.\n\nCSS stod för hela **80%** (_JavaScript stod för 1.3%_) av repot på GitHub och detta gjorde det svårt att vidareutveckla och underhålla sajten, även om allt var skrivet med SCSS och inte ren CSS.\n\nMycket av den styling som fanns var som sagt scoped till olika sektioner, via css selektorer på olika classer:\n\n```css showLineNumbers\nsection.hero-content {\n  background: pink;\n  color: red;\n  h2 {\n    color: blue;\n    font-size: 18px;\n  }\n}\n\nsection.about-content {\n  background: yellow;\n  color: red;\n  h2 {\n    color: green;\n    font-size: 22px;\n  }\n}\n```\n\nDetta gjorde att **varje sektion var lite väl enkapsulerad och för lite stilregler var generella** då typsnitt och så vidare ibland levde sitt egna liv inom varje sektion.\n\nDå jag byggde sajten innan jag fick mitt första jobb inom branschen ville jag dessutom ha ett portfolio som stack ut i mängden och var väldesignat, för att på något sätt kompensera arbetslivserfarenhet inom yrket.\n\nI och med den här flytten till Next.js är läget däremot annorlunda. Jag behöver inte denna sajt för att \"ta mig in i branschen\" och erfarenheten av att försöka underhålla tidigare design fick mig att istället [välja en mer avskalad approach](/blogg/portfolio-redesign), som är lättare att underhålla.\n\n### Inget komponenttänk\n\nI dag när man bygger modernare frontends använder man kanske React, Angular eller Vue för att bygga återanvändbara komponenter.  \nNågot sådant komponenttänk fanns inte i strukturen för mitt portfolio direkt. Eller jo... till viss del kunde man skapa \"komponenter\" med Jekyll i och med html templates och scopa css till dem.\n\n```html:_includes/sections/projects.html {7} showLineNumbers\n<!-- Assign sorted order for portfolio projects -->\n{% assign sorted_portfolio = site.projects | sort:\"order\" %}\n<!-- loop through sorted portfolio items -->\n{% for portfolio in sorted_portfolio %}\n<div class=\"row\">\n  <div class=\"col-md-10 col-md-offset-1\">\n    <div id=\"{{ portfolio.title | slugify }}\" class=\"card\">\n      <div class=\"row\">{% include _portfolioCard.html %}</div>\n    </div>\n  </div>\n</div>\n{% endfor %}\n```\n\nSådär loopads portfolio projekt igenom och en **\\_portfolioCard.html** template agerade komponent.\n\nLägg märke till rad 7, `<div id=\"{{ portfolio.title | slugify }}\" class=\"card\">`. Klassen _\"card\"_ sattes på föräldern och utifrån förälderns css-klass sattes styling.  \nDetta innebar att skulle man inkludera templaten med `{% include _portfolioCard.html %}` **utanför** ett förälder-element med den klassen hade all styling gått förlorad. Komponenten var inte kopplad med sin behövda styling.\n\n**\\_portfolioCard.html** såg i sin tur ut såhär:\n\n```html:_includes/_portfolioCard.html showLineNumbers\n<!-- Card template for portfolio items -->\n<!-- Different left or right layout depending on the front matter -->\n<div class=\"col-md-6 {% if portfolio.card-layout == 'right' %}col-md-push-6{% endif %}\">\n  <a href=\"{{ portfolio.url | relative_url }}\">\n    <img class=\"text-center\" src=\"{{ portfolio.thumbnail }}\" alt=\"Bild på {{ portfolio.title }}\">\n  </a>\n</div>\n<div class=\"col-md-6 {% if portfolio.card-layout == 'right' %}col-md-pull-6{% endif %}\">\n  <a class=\"title-link\" href=\"{{ portfolio.url | relative_url }}\">{{ portfolio.title | escape }}</a>\n  <p>{{ portfolio.desc }}</p>\n  {% for tag in portfolio.tags %}\n    <span class=\"tag\">{{ tag }}</span>\n  {% endfor %}\n  <div class=\"links\">\n    <a href=\"{{ portfolio.url | relative_url }}\">Mer info</a>\n    {% if portfolio.website %}\n      <a target=\"_blank\" href=\"{{ portfolio.website }}\">Besök</a>\n    {% endif %}\n  </div>\n</div>\n```\n\nMen man kunde aldrig bli lika flexibel med html template komponenter såsom man kan vara med React och exempelvis Styled Components.\n\n### Gammal utvecklingsmiljö\n\nOj oj oj. Utvecklingsmiljön började kännas alldeles för gammal. Detta upptäckte jag en dag när jag skulle göra lite JavaScriptändringar på sajten.  \nEn ganska gammal version av `Gulp` användes för att slå ihop och minifera den lilla JavaScript som fanns. Denna version lirade inte alls med **node versioner > 10**.\n\nAtt uppdatera Gulp kändes inte som ett alternativ då syntaxen var helt förändrad i nyare versioner. Jag var alltså något låst i för gammal tooling och hela utvecklingsmiljön kändes bara begränsande.\n\n## Att börja fundera på det modernare, gröna gräset på andra sidan\n\nDet var alltså dags att hitta alternativa lösningar till Jekyll. Jag hade följande checklista som utgångspunkt\n\n- React\n- TypeScript\n- Artiklar i form av markdown\n- Statiskt genererad\n\nJag insåg rätt tidigt att jag ville bygga mitt nya portfolio med hjälp av **Next.js**. Detta för att det är Reactbaserat, har bra TypeScript support, stöd för statisk generering och innehåll i form av markdown.  \nDessutom möjligör [vercel](https://vercel.com) zero-config deployments för Next.js webbapplikationer.\n\n## Skrida till verket\n\nEgentligen tog det ju inte bara tre dagar att byta ut mitt gamla portfolio, om man räknar med tid till research och design av mockups i Figma. Däremot tog det bara tre dagar från det att jag skrev första kodraden.\n\nMan skulle kunna dela upp hela processen i tre, rätt så vanliga delar: research, design och implementation.\n\n### Research\n\nSom tidigare nämnt så hade jag bestämt mig för **Next.js**. Däremot fanns det ju fortfarande en del frågetecken såsom: Hur ska jag generera innehåll utifrån markdown-filer och vilken väg ska jag gå för styling?\n\nJag tänker inte rabbla upp alla npm paket som installerades, vill man ha mer info om sådan är det bara att [kika i readmen](https://github.com/danielv14/personal-portfolio) eller tillhörande **package.json** för repot.\n\n### Design\n\nJag visste från början att jag ville ha en mer avskalad design, med fokus på innehållet. Jag visste även att jag ville ha ett ljust och ett mörkt tema.\n\nUtifrån de två punkterna skissade jag på en mobile-first design för sajten i Figma, bestämde layout för startsidan, spikade färger och så vidare.\n\n### Implementation\n\nNu kommer vi till \"tre dagars\" historien. I och med att jag i princip hade allting klart för mig, vilka npm paket jag behövde installera, hur designen skulle se ut och så vidare blev det inte speciellt mycket funderingar under själva utvecklingsfasen.\n\nJag använde `create-next-app` för att generera en bra startpunkt och därefter var det bara börja koda.\n\n```bash\nnpx create-next-app --example with-typescript-styled-components\n```\n\nEn lördag-söndag-måndagskväll senare och denna sajt var deployad via **Vercel**. Alla ompekningar var gjorda och [www.danielvernberg.se](https://www.danielvernberg.se) fick sig ett ansiktslyft både utvändigt och invändigt.\n","code":"var Component=(()=>{var p=Object.create;var t=Object.defineProperty;var m=Object.getOwnPropertyDescriptor;var h=Object.getOwnPropertyNames;var u=Object.getPrototypeOf,k=Object.prototype.hasOwnProperty;var N=(a,n)=>()=>(n||a((n={exports:{}}).exports,n),n.exports),g=(a,n)=>{for(var s in n)t(a,s,{get:n[s],enumerable:!0})},c=(a,n,s,i)=>{if(n&&typeof n==\"object\"||typeof n==\"function\")for(let l of h(n))!k.call(a,l)&&l!==s&&t(a,l,{get:()=>n[l],enumerable:!(i=m(n,l))||i.enumerable});return a};var f=(a,n,s)=>(s=a!=null?p(u(a)):{},c(n||!a||!a.__esModule?t(s,\"default\",{value:a,enumerable:!0}):s,a)),v=a=>c(t({},\"__esModule\",{value:!0}),a);var o=N((S,r)=>{r.exports=_jsx_runtime});var x={};g(x,{default:()=>y,frontmatter:()=>b});var e=f(o()),b={title:\"Att g\\xE5 fr\\xE5n Jekyll till Next.js p\\xE5 tre dagar\",summary:\"Jag har l\\xE4nge funderat p\\xE5 att byta ut Jekyll f\\xF6r h\\xE4r webbplatsen. Efter en del research och funderingar var det g\\xF6rbart p\\xE5 tre dagar.\",date:new Date(15933888e5)};function d(a){let n=Object.assign({p:\"p\",strong:\"strong\",ul:\"ul\",li:\"li\",h3:\"h3\",a:\"a\",span:\"span\",em:\"em\",pre:\"pre\",code:\"code\",br:\"br\",div:\"div\",h2:\"h2\"},a.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(n.p,{children:\"F\\xF6r ett antal \\xE5r sedan byggde jag min personliga webbplats/portfolio med hj\\xE4lp av Jekyll. Med hj\\xE4lp av Jekyll kunde jag skapa en enklare statiskt generad webbplats - d\\xE4r jag kunde skriva enklare artiklar i markdown.\"}),`\n`,(0,e.jsx)(n.p,{children:\"\\xC5ren gick och jag uppdaterade sporadiskt denna webbplats med lite design-tweaks och nya artiklar. Nu, \\xE5r 2020 ser landskapet annorlunda ut n\\xE4r det g\\xE4ller verktyg f\\xF6r att generera statiska webbplatser och jag k\\xE4nde att det var dags f\\xF6r en f\\xF6r\\xE4ndring.\"}),`\n`,(0,e.jsx)(n.p,{children:(0,e.jsx)(n.strong,{children:'Men varf\\xF6r byta ut n\\xE5got som \"funkar? Vad var det f\\xF6r fel p\\xE5 min setup med Jekyll?'})}),`\n`,(0,e.jsx)(n.p,{children:\"Tja...det fanns v\\xE4l en del anledningar till att jag ans\\xE5g att det var dags f\\xF6r en f\\xF6r\\xE4ndring och jag t\\xE4nkte ta upp n\\xE5gra av dom:\"}),`\n`,(0,e.jsxs)(n.ul,{children:[`\n`,(0,e.jsx)(n.li,{children:\"Sv\\xE5rjobbad styling\"}),`\n`,(0,e.jsx)(n.li,{children:\"Inget komponentt\\xE4nk\"}),`\n`,(0,e.jsx)(n.li,{children:\"Gammal utvecklingsmilj\\xF6\"}),`\n`]}),`\n`,(0,e.jsxs)(n.h3,{id:\"sv\\xE5rjobbad-styling\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#sv\\xE5rjobbad-styling\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Sv\\xE5rjobbad styling\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"N\\xE4r jag byggde sajten var jag v\\xE4ldigt inne p\\xE5 \",(0,e.jsx)(n.em,{children:\"lekfull design\"}),\". Sj\\xE4lva startsidan var uppdelad i olika sektioner som alla i stort s\\xE4tt hade olika bakgrundsf\\xE4rger och textf\\xE4rger. Avsaknaden av konsekvens i design gjorde sajten sv\\xE5rjobbad, rent designm\\xE4ssigt.\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"CSS stod f\\xF6r hela \",(0,e.jsx)(n.strong,{children:\"80%\"}),\" (\",(0,e.jsx)(n.em,{children:\"JavaScript stod f\\xF6r 1.3%\"}),\") av repot p\\xE5 GitHub och detta gjorde det sv\\xE5rt att vidareutveckla och underh\\xE5lla sajten, \\xE4ven om allt var skrivet med SCSS och inte ren CSS.\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Mycket av den styling som fanns var som sagt scoped till olika sektioner, via css selektorer p\\xE5 olika classer:\"}),`\n`,(0,e.jsx)(n.pre,{className:\"language-css\",children:(0,e.jsxs)(n.code,{className:\"language-css code-highlight\",children:[(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"1\",children:[(0,e.jsxs)(n.span,{className:\"token selector\",children:[\"section\",(0,e.jsx)(n.span,{className:\"token class\",children:\".hero-content\"})]}),\" \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"{\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"2\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token property\",children:\"background\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"pink\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"3\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token property\",children:\"color\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"red\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"4\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token selector\",children:\"h2\"}),\" \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"{\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"5\",children:[\"    \",(0,e.jsx)(n.span,{className:\"token property\",children:\"color\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"blue\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"6\",children:[\"    \",(0,e.jsx)(n.span,{className:\"token property\",children:\"font-size\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token number\",children:\"18\"}),(0,e.jsx)(n.span,{className:\"token unit\",children:\"px\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"7\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"}\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"8\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"}\"}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"9\",children:`\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"10\",children:[(0,e.jsxs)(n.span,{className:\"token selector\",children:[\"section\",(0,e.jsx)(n.span,{className:\"token class\",children:\".about-content\"})]}),\" \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"{\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"11\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token property\",children:\"background\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"yellow\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"12\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token property\",children:\"color\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"red\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"13\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token selector\",children:\"h2\"}),\" \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"{\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"14\",children:[\"    \",(0,e.jsx)(n.span,{className:\"token property\",children:\"color\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token color\",children:\"green\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"15\",children:[\"    \",(0,e.jsx)(n.span,{className:\"token property\",children:\"font-size\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\":\"}),\" \",(0,e.jsx)(n.span,{className:\"token number\",children:\"22\"}),(0,e.jsx)(n.span,{className:\"token unit\",children:\"px\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\";\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"16\",children:[\"  \",(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"}\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"17\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"}\"}),`\n`]})]})}),`\n`,(0,e.jsxs)(n.p,{children:[\"Detta gjorde att \",(0,e.jsx)(n.strong,{children:\"varje sektion var lite v\\xE4l enkapsulerad och f\\xF6r lite stilregler var generella\"}),\" d\\xE5 typsnitt och s\\xE5 vidare ibland levde sitt egna liv inom varje sektion.\"]}),`\n`,(0,e.jsx)(n.p,{children:\"D\\xE5 jag byggde sajten innan jag fick mitt f\\xF6rsta jobb inom branschen ville jag dessutom ha ett portfolio som stack ut i m\\xE4ngden och var v\\xE4ldesignat, f\\xF6r att p\\xE5 n\\xE5got s\\xE4tt kompensera arbetslivserfarenhet inom yrket.\"}),`\n`,(0,e.jsxs)(n.p,{children:['I och med den h\\xE4r flytten till Next.js \\xE4r l\\xE4get d\\xE4remot annorlunda. Jag beh\\xF6ver inte denna sajt f\\xF6r att \"ta mig in i branschen\" och erfarenheten av att f\\xF6rs\\xF6ka underh\\xE5lla tidigare design fick mig att ist\\xE4llet ',(0,e.jsx)(n.a,{href:\"/blogg/portfolio-redesign\",children:\"v\\xE4lja en mer avskalad approach\"}),\", som \\xE4r l\\xE4ttare att underh\\xE5lla.\"]}),`\n`,(0,e.jsxs)(n.h3,{id:\"inget-komponentt\\xE4nk\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#inget-komponentt\\xE4nk\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Inget komponentt\\xE4nk\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"I dag n\\xE4r man bygger modernare frontends anv\\xE4nder man kanske React, Angular eller Vue f\\xF6r att bygga \\xE5teranv\\xE4ndbara komponenter.\",(0,e.jsx)(n.br,{}),`\n`,'N\\xE5got s\\xE5dant komponentt\\xE4nk fanns inte i strukturen f\\xF6r mitt portfolio direkt. Eller jo... till viss del kunde man skapa \"komponenter\" med Jekyll i och med html templates och scopa css till dem.']}),`\n`,(0,e.jsx)(n.div,{className:\"rehype-code-title\",children:\"_includes/sections/projects.html\"}),(0,e.jsx)(n.pre,{className:\"language-html\",children:(0,e.jsxs)(n.code,{className:\"language-html code-highlight\",children:[(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"1\",children:[(0,e.jsx)(n.span,{className:\"token comment\",children:\"<!-- Assign sorted order for portfolio projects -->\"}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"2\",children:`{% assign sorted_portfolio = site.projects | sort:\"order\" %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"3\",children:[(0,e.jsx)(n.span,{className:\"token comment\",children:\"<!-- loop through sorted portfolio items -->\"}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"4\",children:`{% for portfolio in sorted_portfolio %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"5\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"row\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"6\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"col-md-10 col-md-offset-1\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number highlight-line\",line:\"7\",children:[\"    \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"id\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.title | slugify }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"card\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"8\",children:[\"      \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"row\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"{% include _portfolioCard.html %}\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"9\",children:[\"    \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"10\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"11\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"12\",children:`{% endfor %}\n`})]})}),`\n`,(0,e.jsxs)(n.p,{children:[\"S\\xE5d\\xE4r loopads portfolio projekt igenom och en \",(0,e.jsx)(n.strong,{children:\"_portfolioCard.html\"}),\" template agerade komponent.\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"L\\xE4gg m\\xE4rke till rad 7, \",(0,e.jsx)(n.code,{children:'<div id=\"{{ portfolio.title | slugify }}\" class=\"card\">'}),\". Klassen \",(0,e.jsx)(n.em,{children:'\"card\"'}),\" sattes p\\xE5 f\\xF6r\\xE4ldern och utifr\\xE5n f\\xF6r\\xE4lderns css-klass sattes styling.\",(0,e.jsx)(n.br,{}),`\n`,\"Detta innebar att skulle man inkludera templaten med \",(0,e.jsx)(n.code,{children:\"{% include _portfolioCard.html %}\"}),\" \",(0,e.jsx)(n.strong,{children:\"utanf\\xF6r\"}),\" ett f\\xF6r\\xE4lder-element med den klassen hade all styling g\\xE5tt f\\xF6rlorad. Komponenten var inte kopplad med sin beh\\xF6vda styling.\"]}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"_portfolioCard.html\"}),\" s\\xE5g i sin tur ut s\\xE5h\\xE4r:\"]}),`\n`,(0,e.jsx)(n.div,{className:\"rehype-code-title\",children:\"_includes/_portfolioCard.html\"}),(0,e.jsx)(n.pre,{className:\"language-html\",children:(0,e.jsxs)(n.code,{className:\"language-html code-highlight\",children:[(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"1\",children:[(0,e.jsx)(n.span,{className:\"token comment\",children:\"<!-- Card template for portfolio items -->\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"2\",children:[(0,e.jsx)(n.span,{className:\"token comment\",children:\"<!-- Different left or right layout depending on the front matter -->\"}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"3\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"col-md-6 {% if portfolio.card-layout == 'right' %}col-md-push-6{% endif %}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"4\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"a\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"href\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.url | relative_url }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"5\",children:[\"    \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"img\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"text-center\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"src\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.thumbnail }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"alt\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"Bild p\\xE5 {{ portfolio.title }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"6\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"a\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"7\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"8\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"col-md-6 {% if portfolio.card-layout == 'right' %}col-md-pull-6{% endif %}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"9\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"a\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"title-link\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"href\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.url | relative_url }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"{{ portfolio.title | escape }}\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"a\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"10\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"p\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"{{ portfolio.desc }}\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"p\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"11\",children:`  {% for tag in portfolio.tags %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"12\",children:[\"    \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"span\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"tag\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"{{ tag }}\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"span\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"13\",children:`  {% endfor %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"14\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"div\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"class\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"links\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"15\",children:[\"    \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"a\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"href\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.url | relative_url }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"Mer info\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"a\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"16\",children:`    {% if portfolio.website %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"17\",children:[\"      \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"<\"}),\"a\"]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"target\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"_blank\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),\" \",(0,e.jsx)(n.span,{className:\"token attr-name\",children:\"href\"}),(0,e.jsxs)(n.span,{className:\"token attr-value\",children:[(0,e.jsx)(n.span,{className:\"token punctuation attr-equals\",children:\"=\"}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'}),\"{{ portfolio.website }}\",(0,e.jsx)(n.span,{className:\"token punctuation\",children:'\"'})]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),\"Bes\\xF6k\",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"a\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsx)(n.span,{className:\"code-line line-number\",line:\"18\",children:`    {% endif %}\n`}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"19\",children:[\"  \",(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]}),(0,e.jsxs)(n.span,{className:\"code-line line-number\",line:\"20\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsxs)(n.span,{className:\"token tag\",children:[(0,e.jsx)(n.span,{className:\"token punctuation\",children:\"</\"}),\"div\"]}),(0,e.jsx)(n.span,{className:\"token punctuation\",children:\">\"})]}),`\n`]})]})}),`\n`,(0,e.jsx)(n.p,{children:\"Men man kunde aldrig bli lika flexibel med html template komponenter s\\xE5som man kan vara med React och exempelvis Styled Components.\"}),`\n`,(0,e.jsxs)(n.h3,{id:\"gammal-utvecklingsmilj\\xF6\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#gammal-utvecklingsmilj\\xF6\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Gammal utvecklingsmilj\\xF6\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"Oj oj oj. Utvecklingsmilj\\xF6n b\\xF6rjade k\\xE4nnas alldeles f\\xF6r gammal. Detta uppt\\xE4ckte jag en dag n\\xE4r jag skulle g\\xF6ra lite JavaScript\\xE4ndringar p\\xE5 sajten.\",(0,e.jsx)(n.br,{}),`\n`,\"En ganska gammal version av \",(0,e.jsx)(n.code,{children:\"Gulp\"}),\" anv\\xE4ndes f\\xF6r att sl\\xE5 ihop och minifera den lilla JavaScript som fanns. Denna version lirade inte alls med \",(0,e.jsx)(n.strong,{children:\"node versioner > 10\"}),\".\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Att uppdatera Gulp k\\xE4ndes inte som ett alternativ d\\xE5 syntaxen var helt f\\xF6r\\xE4ndrad i nyare versioner. Jag var allts\\xE5 n\\xE5got l\\xE5st i f\\xF6r gammal tooling och hela utvecklingsmilj\\xF6n k\\xE4ndes bara begr\\xE4nsande.\"}),`\n`,(0,e.jsxs)(n.h2,{id:\"att-b\\xF6rja-fundera-p\\xE5-det-modernare-gr\\xF6na-gr\\xE4set-p\\xE5-andra-sidan\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#att-b\\xF6rja-fundera-p\\xE5-det-modernare-gr\\xF6na-gr\\xE4set-p\\xE5-andra-sidan\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Att b\\xF6rja fundera p\\xE5 det modernare, gr\\xF6na gr\\xE4set p\\xE5 andra sidan\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Det var allts\\xE5 dags att hitta alternativa l\\xF6sningar till Jekyll. Jag hade f\\xF6ljande checklista som utg\\xE5ngspunkt\"}),`\n`,(0,e.jsxs)(n.ul,{children:[`\n`,(0,e.jsx)(n.li,{children:\"React\"}),`\n`,(0,e.jsx)(n.li,{children:\"TypeScript\"}),`\n`,(0,e.jsx)(n.li,{children:\"Artiklar i form av markdown\"}),`\n`,(0,e.jsx)(n.li,{children:\"Statiskt genererad\"}),`\n`]}),`\n`,(0,e.jsxs)(n.p,{children:[\"Jag ins\\xE5g r\\xE4tt tidigt att jag ville bygga mitt nya portfolio med hj\\xE4lp av \",(0,e.jsx)(n.strong,{children:\"Next.js\"}),\". Detta f\\xF6r att det \\xE4r Reactbaserat, har bra TypeScript support, st\\xF6d f\\xF6r statisk generering och inneh\\xE5ll i form av markdown.\",(0,e.jsx)(n.br,{}),`\n`,\"Dessutom m\\xF6jlig\\xF6r \",(0,e.jsx)(n.a,{href:\"https://vercel.com\",children:\"vercel\"}),\" zero-config deployments f\\xF6r Next.js webbapplikationer.\"]}),`\n`,(0,e.jsxs)(n.h2,{id:\"skrida-till-verket\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#skrida-till-verket\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Skrida till verket\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Egentligen tog det ju inte bara tre dagar att byta ut mitt gamla portfolio, om man r\\xE4knar med tid till research och design av mockups i Figma. D\\xE4remot tog det bara tre dagar fr\\xE5n det att jag skrev f\\xF6rsta kodraden.\"}),`\n`,(0,e.jsx)(n.p,{children:\"Man skulle kunna dela upp hela processen i tre, r\\xE4tt s\\xE5 vanliga delar: research, design och implementation.\"}),`\n`,(0,e.jsxs)(n.h3,{id:\"research\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#research\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Research\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"Som tidigare n\\xE4mnt s\\xE5 hade jag best\\xE4mt mig f\\xF6r \",(0,e.jsx)(n.strong,{children:\"Next.js\"}),\". D\\xE4remot fanns det ju fortfarande en del fr\\xE5getecken s\\xE5som: Hur ska jag generera inneh\\xE5ll utifr\\xE5n markdown-filer och vilken v\\xE4g ska jag g\\xE5 f\\xF6r styling?\"]}),`\n`,(0,e.jsxs)(n.p,{children:[\"Jag t\\xE4nker inte rabbla upp alla npm paket som installerades, vill man ha mer info om s\\xE5dan \\xE4r det bara att \",(0,e.jsx)(n.a,{href:\"https://github.com/danielv14/personal-portfolio\",children:\"kika i readmen\"}),\" eller tillh\\xF6rande \",(0,e.jsx)(n.strong,{children:\"package.json\"}),\" f\\xF6r repot.\"]}),`\n`,(0,e.jsxs)(n.h3,{id:\"design\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#design\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Design\"]}),`\n`,(0,e.jsx)(n.p,{children:\"Jag visste fr\\xE5n b\\xF6rjan att jag ville ha en mer avskalad design, med fokus p\\xE5 inneh\\xE5llet. Jag visste \\xE4ven att jag ville ha ett ljust och ett m\\xF6rkt tema.\"}),`\n`,(0,e.jsx)(n.p,{children:\"Utifr\\xE5n de tv\\xE5 punkterna skissade jag p\\xE5 en mobile-first design f\\xF6r sajten i Figma, best\\xE4mde layout f\\xF6r startsidan, spikade f\\xE4rger och s\\xE5 vidare.\"}),`\n`,(0,e.jsxs)(n.h3,{id:\"implementation\",children:[(0,e.jsx)(n.a,{\"aria-hidden\":\"true\",tabIndex:\"-1\",href:\"#implementation\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Implementation\"]}),`\n`,(0,e.jsx)(n.p,{children:'Nu kommer vi till \"tre dagars\" historien. I och med att jag i princip hade allting klart f\\xF6r mig, vilka npm paket jag beh\\xF6vde installera, hur designen skulle se ut och s\\xE5 vidare blev det inte speciellt mycket funderingar under sj\\xE4lva utvecklingsfasen.'}),`\n`,(0,e.jsxs)(n.p,{children:[\"Jag anv\\xE4nde \",(0,e.jsx)(n.code,{children:\"create-next-app\"}),\" f\\xF6r att generera en bra startpunkt och d\\xE4refter var det bara b\\xF6rja koda.\"]}),`\n`,(0,e.jsx)(n.pre,{className:\"language-bash\",children:(0,e.jsx)(n.code,{className:\"language-bash code-highlight\",children:(0,e.jsxs)(n.span,{className:\"code-line\",children:[\"npx create-next-app \",(0,e.jsx)(n.span,{className:\"token parameter variable\",children:\"--example\"}),` with-typescript-styled-components\n`]})})}),`\n`,(0,e.jsxs)(n.p,{children:[\"En l\\xF6rdag-s\\xF6ndag-m\\xE5ndagskv\\xE4ll senare och denna sajt var deployad via \",(0,e.jsx)(n.strong,{children:\"Vercel\"}),\". Alla ompekningar var gjorda och \",(0,e.jsx)(n.a,{href:\"https://www.danielvernberg.se\",children:\"www.danielvernberg.se\"}),\" fick sig ett ansiktslyft b\\xE5de utv\\xE4ndigt och inv\\xE4ndigt.\"]})]})}function j(a={}){let{wrapper:n}=a.components||{};return n?(0,e.jsx)(n,Object.assign({},a,{children:(0,e.jsx)(d,a)})):d(a)}var y=j;return v(x);})();\n;return Component;"},"_id":"posts/att-ga-fran-jekyll-till-next-pa-tre-dagar.mdx","_raw":{"sourceFilePath":"posts/att-ga-fran-jekyll-till-next-pa-tre-dagar.mdx","sourceFileName":"att-ga-fran-jekyll-till-next-pa-tre-dagar.mdx","sourceFileDir":"posts","contentType":"mdx","flattenedPath":"posts/att-ga-fran-jekyll-till-next-pa-tre-dagar"},"type":"Post","url":"/blogg/att-ga-fran-jekyll-till-next-pa-tre-dagar","dateFormatted":"2020-06-29"}},"__N_SSG":true}