{"pageProps":{"posts":[{"title":"Hur Aftonbladet pajade min sajt och varför det är okej att låta det ligga i backloggen tillsvidare","summary":"För ett tag sedan gjorde Aftonbladet ganska stora ändringar på sin startsida som resulterade till att en av mina sajter i princip vart värdelös. Men det är helt okej!","date":"2021-07-09","url":"/blogg/hur-aftonbladet-pajade-min-sajt-och-varfor-det-ar-okej-att-lata-det-ligga-i-backloggen-tillsvidare"},{"title":"När man förmodligen vill byta ut useState mot useReducer","summary":"Hook:en useState är bra till mycket. Men ibland räcker inte den inte hela vägen. Det här är lite reflektioner över första gången jag använde useReducer för att lösa lite mer avancerad state.","date":"2021-02-13","url":"/blogg/nar-man-formodligen-vill-byta-ut-use-state-mot-use-reducer"},{"title":"Media Queries á la styled-components","summary":"Tre olika, men också snarlika, exempel på hur man kan jobba med CSS Media Queries i styled-components.","date":"2020-11-01","url":"/blogg/media-queries-a-la-styled-components"},{"title":"Varför det är bra att enas om dataformat i ett tidigt skede","summary":"Dataformat kan många gånger hjälpa till att förhindra blockers och lösa upp beroenden. Att enas om dataformat kan innebära att man kan jobba mot samma sprintmål, från flera olika håll samtidigt.","date":"2020-10-07","url":"/blogg/varfor-det-ar-bra-att-enas-om-dataformat-i-ett-tidigt-skede"},{"title":"Kom igång med Framer Motion och styled-components","summary":"För ett litet tag sedan experimenterade jag med att implementera animationer med Framer Motion på denna sajt. Kombinationen Framer Motion och styled-components visade sig vara rätt trevligt och så här snabbt kan man komma igång.","date":"2020-07-25","url":"/blogg/framer-motion-och-styled-components"},{"title":"Skapa API-middlewares i Next.js","summary":"Att implementera middlewares i Next.js behöver inte vara svårt. Så här kan man enkelt skapa återanvändbara middlewares för API-endpoints i sin applikation.","date":"2020-07-09","url":"/blogg/api-middlewares-i-nextjs"},{"title":"Styled Components och ikonhantering i olika stadier","summary":"Hur många gånger kan man behöva refaktorera ikoner egentligen? Minst två gånger i alla fall - allt eftersom behovet på funktionalitet ändras.","date":"2020-07-03","url":"/blogg/styled-components-och-ikonhantering-i-olika-stadier"},{"title":"Ny utvecklingsmiljö och nytt deployflöde för denna sajt","summary":"Vad betydde det för utvecklingsmiljön och deployflödet för denna sajt när den gick från Jekyll till Next.js?","date":"2020-07-01","url":"/blogg/ny-utvecklingsmiljo-och-nytt-deployflode-for-denna-site"},{"title":"Portfolio Redesign: Keep it simple","summary":"Summering av några punkter kring omdesignen av denna webbplats: enklare mobile-first design, stöd för ljust och mörkt tema, css variabler och styling som reactkomponenter.","date":"2020-06-30","url":"/blogg/portfolio-redesign"},{"title":"Att gå från Jekyll till Next.js på tre dagar","summary":"Jag har länge funderat på att byta ut Jekyll för här webbplatsen. Efter en del research och funderingar var det görbart på tre dagar.","date":"2020-06-29","url":"/blogg/att-ga-fran-jekyll-till-next-pa-tre-dagar"},{"title":"Att väcka liv i ett 3 år gammalt projekt i 6 enkla steg","summary":"För tre år sedan skapade jag ett projekt som skrapade Aftonbladet dagligen. Det här är historien om vad som hände 3 år senare.","date":"2020-03-29","url":"/blogg/att-vacka-liv-i-ett-3-ar-gammalt-projekt"},{"title":"ColorPix och \"Less is more\" UX-förändringar","summary":"Med några enklare refaktoreringar blev användarupplevelsen enklare men låter samtidigt användaren göra mer.","date":"2019-07-31","url":"/blogg/colorpix-ux-forandringar"},{"title":"IMDb CLI version 1.0.1 till 2.3.0","summary":"Detta är vad som har hänt från version 1.0.1 till version 2.3.0.","date":"2019-07-08","url":"/blogg/imdb-cli-version-2-3-0"},{"title":"Skapa ett request plugin i Nuxt.js","summary":"Så här skapar man enkelt ett request-plugin baserat på axios i Nuxt.js","date":"2019-06-15","url":"/blogg/skapa-ett-request-plugin-i-nuxtjs"},{"title":"Node-baserat CLI för att skrapa IMDb","summary":"Enkelt CLI för att få tag i viss information från IMDb genom att skrapa sajten.","date":"2017-09-01","url":"/blogg/node-cli-for-att-skrapa-imdb"},{"title":"Ladda ned trailers via terminalen","summary":"Kombinera cli-verktyg för att snabbt och enkelt ladda ned trailers från YouTube.","date":"2017-03-30","url":"/blogg/ladda-ned-trailers-via-terminalen"},{"title":"Jekyll och Rake tasks","summary":"Enkla kommandon för att snabba upp skapandet av blogginlägg i markdown.","date":"2017-03-26","url":"/blogg/jekyll-och-rake"},{"title":"Min utvecklingsmiljö","summary":"Så här ser min utvecklingsmiljö ut just nu.","date":"2017-03-24","url":"/blogg/min-utvecklingsmiljo"}]},"__N_SSG":true}